# -*- coding: utf-8 -*-
# Файл ресурсов содержащий строки сообщений, которые выдает наш бот

msg_str = "Start"
msg_help = "Бот для заказа комбинезонов 'Walk Moda'.\nВыбери комбинезон своей мечты и сделай заказ всего в пару кликов!\nДля начала диалога с ботом используй команду /start"
msg_hello = "Привет, я Walk.Moda Бот! Выбери комбинезон 'Walk Moda' в твоем стиле!"
msg_default = "Нажимай кнопки соответствующего раздела для выбора заказа"
btn_request_tel_number = "Отправить номер телефона"
msg_request_tel_number = "Нажмите на кнопку 'Отправить номер телефона', чтобы наш менеджер связался с Вами для совершения покупки.\nНажимая кнопку, Вы даете согласие на обработку Ваших персональных данных"
msg_new_realizes = "Тут будут представлены новинки"
msg_success_zakaz = "Ваш заказ успешно отправлен менеджеру. В ближайшее врямя с Вами свяжутся по вопросам оплаты и доставки."
msg_complete = "Ваш заказ:\n"
msg_is_right_order = "Заказ сформирован верно ?"

# категории
msg_category1 = "Комбинезоны 🛍"
msg_category2 = "Отзывы наших клиентов 👍"
msg_category3 = "Новинки сезона 🎁"

msg_button_back = "<- Назад"


# строки для категории 1   \u25B6 
msg_category1_1 = "1. Лайм"
msg_category1_2 = "2. Фуксия"
msg_category1_3 = "3. Черный"
msg_category1_4 = "4. Ромбики мини"
msg_category1_5 = "5. Краски"
msg_category1_6 = "6. Камуфляж"
msg_category1_7 = "7. Красный"
msg_category1_8 = "8. Мята"
msg_category1_9 = "9. Фиолетовый"

# пути к файлам категории 1
res_category1_1 = "res/lime.jpg"
res_category1_2 = "res/fukcy.jpg"
res_category1_3 = "res/black.jpg"
res_category1_4 = "res/rombik.jpg"
res_category1_5 = "res/kraski.jpg"
res_category1_6 = "res/hacky.jpg"
res_category1_7 = "res/red.jpg"
res_category1_8 = "res/myata.jpg"


msg_category1_bot = "Выберите комбинезон своей мечты:"


# строки для категории 2 \u25B6
msg_category2_1 = "Прочитать отзывы"
msg_category2_2 = ""
msg_category2_bot = "Отзывы наших клиентов:"
msg_user_feedback = "Тут будет отзыв счастливого клиента"


# строки для категории новинки сезона
msg_category3_1 = "Новинки этого сезона:"
msg_category3_bot = "Выберите новинки этого сезона:"


# строки для выбора роста
msg_rost_info = "Укажи свой рост нажав кнопку:"
msg_rost1 = "152"
msg_rost2 = "158"
msg_rost3 = "164"
msg_rost4 = "170"
msg_rost5 = "176"
msg_rost6 = "182"


# строки для выбора размера
msg_razmer_info = "Выбери размер комбинезона кнопкой:"
msg_razmer1 = "40"
msg_razmer2 = "42"
msg_razmer3 = "44"
msg_razmer4 = "46"
msg_razmer5 = "48"
msg_razmer6 = "50"


# кнопки с выбором количества курток
quantity1 = "1 шт."
quantity2 = "2 шт."
quantity3 = "3 шт."
quantity4 = "4 шт."
quantity5 = "5 шт."
msg_quantity = "Выберите цифру, количество в шт. выбранного Вами комбинезона:"


# кнопки для выбора комплектации:
msg_VIP_info = "Особенность комбинезонов Walk! в том, что они приталены по фигуре мягкой резинкой, для того чтобы даже зимой девушка чувствовала себя женственной и красивой."
msg_VIP_info1 = "А главное преимущество комбинезонов в том, что вместо обычного синтетического подклада мы используем мягкий теплый флис."
msg_VIP_info2 = "Выбери комплектацию (тип наполнителя):\nCITY - это VIP комплектация для Вашего максимального комфорта\nSPORT - для активного отдыха"
msg_VIP_button1 = "CITY VIP"
msg_VIP_button2 = "SPORT"
msg_VIP1 = "CITY за 19990 руб"
msg_VIP2 = "SPORT за 14990 руб"


# кнопки для меню - Все верно ?! или вернуться назад
btn_is_right_order1 = "Все верно! 👍"
btn_is_right_order2 = "Назад к выбору комбинезона 🖐"

# строки для категории 3 с выбором
msg_category3_array = ['1.', '2.', '3.', '4.', '5.']
